%=== Завдання #2.1 ===
%Реалізація фільтру поліноміального згладжування
fs=1000;
bp=[-3 12 17 12 -3]/35; % коефіцієнти різницевого рівняння
ap=1;
n=512; % кількість точок, що розраховуються
figure(4);
[h,w]=freqz(bp,ap,n); %задаємо вектор коефіцієнтів різницевого рівняння
mag = abs(h); %АЧХ
phase=angle(h)*180/pi; %ФЧХ
subplot(211), plot(w/(2*pi)*fs, mag), grid on; %будуємо графік АЧХ
title('АЧХ');
xlabel('Частота, fs'), ylabel('Амплітуда, дБ');
subplot(212), plot(w/(2*pi)*fs, unwrap(phase)), grid on; %будуємо графік ФЧХ
title('ФЧХ');
xlabel('Частота, fs'), ylabel('Фаза, °');
disp('Нулі поліноміального фільтра')
xp=roots(bp); %знаходимо нулі поліноміального фільтра
disp(xp);
figure(5);
zp=zplane(xp); %будуємо карту нулів та полюсів фільтру

clear

%=== Завдання #2.2 ===
%Фільтрація ЕКГ файл ecg117.dat з використанням фільтру 
%поліноміального згладжування
ecg=load('ecg117.dat');  %завантажуємо сигнал ЕКГ із шумом
ecgDetrend=detrend(ecg); %видаляємо постійну складову з сигналу
ecgf5=filter (bp,ap,ecgDetrend); %виконуємо фільтрацію сигналу фільтром поліноміального згладжування
t=(0:length(ecgDetrend)-1)/fs;
figure(6);
subplot(211), plot(ecgDetrend), xlim([3000 3400]); %виділяємо діапазон хвилі
title('Нефільтрований сигнал ЕКГ'); %будуємо графік нефільтрованого сигналу ЕКГ
xlabel('Час, t'), ylabel('Амплітуда');
subplot(212), plot(ecgf5), xlim([3000 3400]); %виділяємо діапазон хвилі
title('Відфільтрований сигнал ЕКГ'); %будуємо графік відфільтрованого сигналу ЕКГ
xlabel('Час, t'), ylabel('Амплітуда');


