%=== Завдання #1.1 ===
% Реалізація фільтру Хеннінга, обчислення АЧХ та ФЧХ
fs=1000; %частота відліків
b = [1 2 1]/4; %коефіцієнти різницевого рівняння
a = 1; 
n = 512; %кількість точок, що розраховуються
figure(30)
[h,w] = freqz(b,a,n); %задаємо вектор коефіцієнтів різницевого рівняння
mag = abs(h); phase = angle(h)*180/pi; % АЧХ і ФЧХ
subplot(211); plot(w/(2*pi)*fs,mag), grid on    %будуємо графік АЧХ
xlabel ('Частота, fs'), title('АЧХ'); ylabel ('Амплітуда, дБ'); 
subplot(212), plot(w/(2*pi) *fs,unwrap(phase)), grid on    %будуємо графік ФЧХ
xlabel ('Частота, fs'), title('ФЧХ'); ylabel ('Фаза, °');

%=== Завдання #1.2 ===
% Обчислення нулів фільтру
disp('Нулі фільтра Хеннінга')
x = roots(b); %обчислюємо нулі фільтра
disp(x);

%=== Завдання #1.3 ===
% Фільтрація ЕКГ, файл ecg117.dat
fs=1000;
b=[1 2 1]/4; % коефіцієнти різницевого рівняння
a=1;
n=512; % кількість точок, що розраховуються
ecg=load('ecg117.dat'); %завантажуємо сигнал ЕКГ із шумом
ecgDetr=detrend(ecg); %видаляємо постійну складову з сигналу
ecgf=filter (b,a,ecgDetr); %виконуємо фільтрацію сигналу фільтром Хеннінга
t=(0:length(ecgDetr)-1)/fs;
figure(3);
subplot(3,1,1), plot(t,ecg), xlim([1.1 1.6]); %виділяємо діапазон хвилі
title('Нефільтрований сигнал ЕКГ'); %будуємо графік нефільтрованого сигналу ЕКГ
xlabel('Час, t'), ylabel('Амплітуда');
subplot(3,1,2), plot(t,ecgDetr), xlim([1.1 1.6]); %виділяємо діапазон хвилі 
title('Cигнал ЕКГ без постійної складової'); %будуємо графік сигналу ЕКГ без постійної складової
xlabel('Час, t'), ylabel('Амплітуда');
subplot(3,1,3), plot(t,ecgf), xlim([1.1 1.6]); %виділяємо діапазон хвилі
title('Відфільтрований сигнал ЕКГ'); %будуємо графік відфільтрованого сигналу ЕКГ
xlabel('Час, t'), ylabel('Амплітуда');

