%=== Завдання #3.1 ===
% Дослідження властивостей простого режекторного фільтру
fs=200;
br=[1 0.618 1]; % коефіцієнти різницевого рівняння
ar=1;
n=512; % кількість точок, що розраховуються
figure(7);
[h,w]=freqz(br,ar,n); %задаємо вектор коефіцієнтів різницевого рівняння
mag = abs(h); % АЧХ
phase=angle(h)*180/pi; % ФЧХ
subplot(211), plot(w/(2*pi)*fs, mag), grid on; %будуємо графік АЧХ
title('АЧХ'); %будуємо графік АЧХ
xlabel('Частота, fs'), ylabel('Амплітуда, дБ');
subplot(212), plot(w/(2*pi)*fs, unwrap(phase)), grid on; %будуємо графік ФЧХ
title('ФЧХ'); %будуємо графік ФЧХ
xlabel('Частота, fs'), ylabel('Фаза, °');
disp('Нулі режекторного фільтра')
xr=roots(br); %знаходимо нулі режекторного фільтра
disp(xr);
figure(5);
zp=zplane(xr); %будуємо карту нулів та полюсів фільтру
 
clear

%=== Завдання #3.2 ===
% Фільтрація сигналу ЕКГ (файл ecg2х60.dat) режекторним фільтром
fs=250;
br=[1 0.618 1]; % коефіцієнти різницевого рівняння
ar=1;
n=512; % кількість точок, що розраховуються
ecg=load('ecg2x60.dat'); %завантажуємо сигнал ЕКГ з мережевою перешкодою
ecgDetr=detrend(ecg); %видаляємо постійну складову з сигналу
ecgf8=filter (br,ar,ecgDetr);
t=(0:length(ecgDetr)-1)/fs;
figure(8);
subplot(2,1,1), plot(t,ecgDetr), xlim([1.1 1.6]); %виділяємо діапазон хвилі
title('Нефільтрований сигнал ЕКГ');
xlabel('Час, t'), ylabel('Амплітуда'); %будуємо графік нефільтрованого сигналу ЕКГ
subplot(2,1,2), plot(t,ecgf8), xlim([1.1 1.6]); %виділяємо діапазон хвилі
title('Відфільтрований сигнал ЕКГ');
xlabel('Час, t'), ylabel('Амплітуда'); %будуємо графік відфільтрованого сигналу ЕКГ
