%=== Завдання #4.1 ===
% Дослідження властивостей диференціаторів 
%перший диференціатор
N = 1;
fs = 200;
bd1 = [1 -1]; % коефіцієнти різницевого рівняння 
ad1 = 1;
n = 512; % кількість точок, що розраховуються
figure(9);
[h,w] = freqz(bd1, ad1, n); %задаємо вектор коефіцієнтів різницевого рівняння
mag = abs(h); phase = angle(h)*180/pi; % АЧХ і ФЧХ
subplot(211); plot(w/(2*pi)*fs,mag), grid on    %будуємо графік АЧХ
xlabel ('Частота, fs'), title('АЧХ'); ylabel ('Амплітуда, дБ'); 
subplot(212), plot(w/(2*pi) *fs,unwrap(phase)), grid on    %будуємо графік ФЧХ
xlabel ('Частота, fs'), title('ФЧХ'); ylabel ('Фаза, °');

clear

%другий диференціатор
N = 2;
fs = 200;
bd2 = [1 -1]/2; % коефіцієнти різницевого рівняння 
ad2 = 1;
n = 512; % кількість точок, що розраховуються
figure(10);
[h,w] = freqz(bd2, ad2, n); %задаємо вектор коефіцієнтів різницевого рівняння
mag = abs(h); phase = angle(h)*180/pi; % АЧХ і ФЧХ
subplot(211); plot(w/(2*pi)*fs,mag), grid on    %будуємо графік АЧХ
xlabel ('Частота, fs'), title('АЧХ'); ylabel ('Амплітуда, дБ'); 
subplot(212), plot(w/(2*pi) *fs,unwrap(phase)), grid on    %будуємо графік ФЧХ
xlabel ('Частота, fs'), title('ФЧХ'); ylabel ('Фаза, °');

%=== Завдання #4.2 ===
% Дослідження процесу диференціювання ЕКГ з шумом (файл ecg117.dat)
%перший диференціатор
N = 1;
fs = 200;
bd1 = [1 -1]; % коефіцієнти різницевого рівняння 
ad1 = 1;
n=512; % кількість точок, що розраховуються
ecg=load('ecg117.dat'); %завантажуємо сигнал ЕКГ з шумом
ecgDetr=detrend(ecg); %видаляємо постійну складову з сигналу
ecgd1=filter (bd1,ad1,ecgDetr);
t=(0:length(ecgDetr)-1)/fs;
figure(11);
subplot(2,1,1), plot(t,ecgDetr), xlim([1.1 1.6]); %виділяємо діапазон хвилі
title('Нефільтрований сигнал ЕКГ');
xlabel('Час, t'), ylabel('Амплітуда');
subplot(2,1,2), plot(t,ecgd1), xlim([1.1 1.6]); %виділяємо діапазон хвилі
title('Відфільтрований сигнал ЕКГ');
xlabel('Час, t'), ylabel('Амплітуда');

clear

%другий диференціатор
N = 2;
fs = 200;
bd2 = [1 -1]/2; % коефіцієнти різницевого рівняння 
ad2 = 1;
n=512; % кількість точок, що розраховуються
ecg=load('ecg117.dat'); %завантажуємо сигнал ЕКГ з шумом
ecgDetr=detrend(ecg); %видаляємо постійну складову з сигналу
ecgd2=filter (bd2,ad2,ecgDetr);
t=(0:length(ecgDetr)-1)/fs;
figure(12);
subplot(2,1,1), plot(t,ecgDetr), xlim([1.1 1.6]); %виділяємо діапазон хвилі
title('Нефільтрований сигнал ЕКГ');
xlabel('Час, t'), ylabel('Амплітуда');
subplot(2,1,2), plot(t,ecgd2), xlim([1.1 1.6]); %виділяємо діапазон хвилі
title('Відфільтрований сигнал ЕКГ');
xlabel('Час, t'), ylabel('Амплітуда');
 